import java.util.Arrays;

//Add Some Comments Here
public class MatrixCalculation {


	/**
	 * 矩阵类，实现矩阵的加法，矩阵乘法
	 * 其中加法和乘法方法需要有两种实现方式
	 * 1.传入一个MyMatrix对象进行2个矩阵的操作
	 * 2.从控制台（console）读入一个矩阵数据，再进行操�?
	 * 所有的数据均为int�?
	 * 输入数据均默认为正确数据，不需要对输入数据进行校验
	 * @author Ray Liu & Qin Liu
	 *
	 */
	
	/**
	 * 实现矩阵加法，返回一个新的矩�?
	 * @param Matrix A 
	 * @param Matrix B
	 * @return result matrix = A + B
	 */
	public int[][] plus(int[][] A, int[][] B){
		
		
		return null;
	}
        
	
	/**
	 * 实现矩阵乘法，返回一个新的矩�?
	 * @param Matrix A 
	 * @param Matrix B
	 * @return result matrix = A * B
	 */
	public int[][] times(int[][] A, int[][] B){
		
		
		return null;
	}
	

	
	/**
	 * 从控制台读入矩阵数据，进行矩阵加法，读入数据格式如下�?
	 * m n
	 * m * n 的数据方阵，以空格隔开
	 * 连续读入2个矩阵数�?
	 * example:
	 * 4 3
	 * 1 2 3 
	 * 1 2 3
	 * 1 2 3
	 * 1 2 3
	 * 4 3
	 * 1 2 3 
	 * 1 2 3
	 * 1 2 3
	 * 1 2 3
	 * 返回一个新的矩�?
	 * @return
	 */
	public int [][] plusFromConsole(){
		
		return null;
	}
	
	/**
	 * 输入格式同上方法相同
	 * 实现矩阵的乘�?
	 * 返回一个新的矩�?
	 * @return
	 */
	public int[][] timesFromConsole(){
		
		return null;
	}
	
	/**
	 * 打印出该矩阵的数�?
	 * 起始一个空行，结束一个空�?
	 * 矩阵中每一行数据呈一行，数据间以空格隔开
	 * example�?
	 * 
	 * 1 2 3
	 * 1 2 3
	 * 1 2 3
	 * 1 2 3
	 * 
	 */
	public void print(){
		
	}
	

}
